/*
*********************************************************************************************************
*
*	模块名称 : 应用程序参数模块
*	文件名称 : param.c
*	版    本 : V1.0
*	说    明 : 读取和保存应用程序的参数
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    2013-01-01 armfly  正式发布
*
*	Copyright (C), 2012-2013, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#include "param.h"

PARAM_T g_tParam;

/* 将16KB 一个扇区的空间预留出来做为参数区 For MDK */
//const uint8_t para_flash_area[16*1024] __attribute__((at(ADDR_FLASH_SECTOR_3)));

/*
*********************************************************************************************************
*	函 数 名: LoadParam
*	功能说明: 从Flash读参数到g_tParam
*	形    参：无
*	返 回 值: 无
*********************************************************************************************************
*/
void LoadParam(void)
{
	/* 填充缺省参数 */
	if (g_tParam.ParamVer != PARAM_VER)
	{
		g_tParam.ParamVer = PARAM_VER;

		g_tParam.ucBackLight = 200;

		g_tParam.Addr = 0xFD;
		g_tParam.Baud = 9600;
		
		g_tParam.Alarm = 20;		/* 单位 mm / s */
		g_tParam.OffsetAdc = 0;		/* 加速度偏移 */
		g_tParam.Rate_5V = 490;	/* 5V对应的加速度,单位M/(s*s) */  /*  100mv - 9.8m/(s*s)  100mv对应9.8米每二次方秒 */
		g_tParam.OffsetStep = 1;	/* 偏移步距默认为10 */
		g_tParam.Mode = 2;			/* 默认为单机模式 0X01代表在线模式，0X02代表单机模式 */
		SaveParam();							/* 将新参数写入Flash */
	}
}

/*
*********************************************************************************************************
*	函 数 名: SaveParam
*	功能说明: 将全局变量g_tParam 写入到CPU内部Flash
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void SaveParam(void)
{

}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
